1.为什么喜欢学习前端。
2.对MVVM框架的理解。
3.angularJS双向绑定原理。
4.了解过其他的MVVM框架吗。
5.React虚拟DOM原理。
6.单向数据流动原理。
6.html5，css3，ES6新特性。
7.ES6中比较好用的语法。
8.对闭包和作用域的理解。
9.js怎么实现面向对象。
10.实现动画的方式。
11.网站性能优化。
12.如何查看一个网站的性能。
13.网站上线后如何查看网站在客户电脑上的性能。
14.收集用户信息主要收集哪些信息。
15.如何进行跨站请求。
16.如果实现跨域资源共享。
17.网站开发的流程，像是技术选型，人员分工这一类，越详细越好。
18.网络分层分为哪几层。
19.状态码301,302。
20.网络中每一层都有哪些协议。
21.浏览器的缓存分为哪几种。
22.常用的排序算法。
23.Web安全。
24.XSS攻击原理及如何防止。
25.需要屏蔽哪些关键词。
26.了解CDN吗。
28.OPTIONS请求的作用。
29.HTTP协议有哪些内容。
30.HTTP2.0新特性。
31.HTTPS相对于HTTP新增了哪些内容。
32.HTTPS是怎么对传输内容进行加密的。
33.同一个页面里面iframe之间怎么传递信息。
34.网站如何实现离线应用。
35.cookier有4096B（加减1）字节的长度限制，容量是多少？js高阶教程p629
36.js怎么实现表单提交按钮的短期重复点击。
37.ajax的post、get方法，优缺点，实现原理
38.盒模型
39.跨域请求方式
40.浏览器安全问题
41.input鼠标滑过获取内容
42.项目中遇到的困难
43.css带src的标签 <link> <a> <img> <audio> <video> 
44.谈谈对闭包的理解
45.		var x=5, o={
			x:10,
			show:function(x){
				var x=20;
				console.log(this.x);//10
				(function show1(){
					console.log(this.x);//5
				})();
				function show2(x){//x是window
					console.log(this.x);//5
				}
				show2(x)
			}
		}
		o.show();
46.typeof(null)==object


47.浏览器缓存的底层实现原理
48.设计模式
49.css框架实现（例如：bootstrap有哪些文件，作用）
50.经常浏览哪些网站(知乎、大漠、阮一峰博客等等，最好说下对公司对应的哪些技术感兴趣)
51.百度前端学院，做了哪些题，怎样实现