一面：
1、==的类型强制转换（0=='0'）  3.0===3.0*1
   变量提升
   变量的命名原则
   不同数据类型值的相互转化
2、css3新特性
3、ul列表，设置前三列颜色不同，4-10列斑马线布局，之后元素隐藏
4、元素隐藏方式
    1）display:none   2）visibility:hidden  3）background-color=color 
    4）移出视口   position:absolute left  float+margin-left  5）z-index:-1;
5、变量以什么开头问题
6、ES6新特性  
7、判断数据类型的方式
  1）typeof  2）instanceof 3）Object.prototype.toString.call();
8、MVC  MVP  MVVM区别
二面和HR（两个面试官一起面的）；
9、项目介绍
10、为什么选择前端
11、用js写Ajax
12、状态码
13、界面有大量的图片，怎样去加快加载时间
14、怎样使用缓存
15、两栏式布局实现
16、怎样修改一个单选或复选框的样式
17、跨域的方式
18、浏览器兼容（我说了绑定事件的）
19、怎样去除字符串中空格，正则表达式可以应用于哪些方面
20、压缩js和css文件的原理
21、闭包及应用
22、jquery语法
23、表述能力怎么样，如果没有任何工具，只口述介绍你的项目
24、希望再怎样环境工作，或对工作环境有什么要求
25、最近吵过架吗？赢了还是输了（不知道意图何在）
26、有什么问题问我的吗（一面也有问）